from transformer import Transformer
import torch
import numpy as np

english_file = 'dataset/en-ml/train.en'
malayalam_file = 'dataset/en-ml/train.ml'

START_TOKEN = ''
PADDING_TOKEN = ''
END_TOKEN = ''

malayalam_vocabulary = [START_TOKEN, ' ', '!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', '/', 
                        '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 
                        ':', '<', '=', '>', '?', 'ˌ', 
                        'ഁ', 'ം', 'ഃ', 'അ', 'ആ', 'ഇ', 'ഈ', 'ഉ', 'ഊ', 'ഋ', 'ഌ', 'എ', 'ഏ', 'ഐ', 'ഒ', 'ഓ', 'ഔ', 
                        'ക', 'ഖ', 'ഗ', 'ഘ', 'ങ', 
                        'ച', 'ഛ', 'ജ', 'ഝ', 'ഞ', 
                        'ട', 'ഠ', 'ഡ', 'ഢ', 'ണ', 
                        'ത', 'ഥ', 'ദ', 'ധ', 'ന', 
                        'പ', 'ഫ', 'ബ', 'ഭ', 'മ', 
                        'യ', 'ര', 'റ', 'ല', 'ള', 'ഴ', 'വ', 'ശ', 'ഷ', 'സ', 'ഹ', 
                        '഼', 'ഽ', 'ാ', 'ി', 'ീ', 'ു', 'ൂ', 'ൃ', 'ൄ', 'െ', 'േ', 'ൈ', 'ൊ', 'ോ', 'ൌ', '്', 'ൎ', 'ൗ', 'ൠ', 'ൡ', 
                        '൦', '൧', '൨', '൩', '൪', '൫', '൬', '൭', '൮', '൯', PADDING_TOKEN, END_TOKEN]

english_vocabulary = [START_TOKEN, ' ', '!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', '/', 
                        '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
                        ':', '<', '=', '>', '?', '@', 
                        'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 
                        'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 
                        'Y', 'Z',
                        '[', '\\', ']', '^', '_', '`', 
                        'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l',
                        'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 
                        'y', 'z', 
                        '{', '|', '}', '~', PADDING_TOKEN, END_TOKEN]

